[
  {
    "tipo": "titulo",
    "nome": "PARTE GERAL",
    "filhos": [
      {
        "tipo": "titulo",
        "nome": "DA APLICAÇÃO DA LEI PENAL",
        "filhos": [
          {
            "tipo": "principio",
            "nome": "Anterioridade da Lei",
            "filhos": [
              {
                "tipo": "artigo",
                "nome": "Art. 1º - Não há crime sem lei anterior que o defina. Não há pena sem prévia cominação legal",
                "filhos": []
              }
            ]
          },
          {
            "tipo": "principio",
            "nome": "Lei penal no tempo",
            "filhos": [
              {
                "tipo": "artigo",
                "nome": "Art. 2º - Ninguém pode ser punido por fato que lei posterior deixa de considerar crime, cessando em virtude dela a execução e os efeitos penais da sentença condenatória.",
                "filhos": []
              }
            ]
          },
          {
            "tipo": "principio",
            "nome": "Lei excepcional ou temporária",
            "filhos": [
              {
                "tipo": "artigo",
                "nome": "Art. 3º - A lei excepcional ou temporária, embora decorrido o período de sua duração ou cessadas as circunstâncias que a determinaram, aplica-se ao fato praticado durante sua vigência.",
                "filhos": []
              }
            ]
          },
          {
            "tipo": "principio",
            "nome": "Tempo do crime",
            "filhos": [
              {
                "tipo": "artigo",
                "nome": "Art. 4º - Considera-se praticado o crime no momento da ação ou omissão, ainda que outro seja o momento do resultado.",
                "filhos": []
              }
            ]
          },
          {
            "tipo": "principio",
            "nome": "Territorialidade",
            "filhos": [
              {
                "tipo": "artigo",
                "nome": "Art. 5º - Aplica-se a lei brasileira, sem prejuízo de convenções, tratados e regras de direito internacional, ao crime cometido no território nacional.   \n § 1º - Para os efeitos penais, consideram-se como extensão do território nacional as embarcações e aeronaves brasileiras, de natureza pública ou a serviço do governo brasileiro onde quer que se encontrem, bem como as aeronaves e as embarcações brasileiras, mercantes ou de propriedade privada, que se achem, respectivamente, no espaço aéreo correspondente ou em alto-mar.    \n § 2º - É também aplicável a lei brasileira aos crimes praticados a bordo de aeronaves ou embarcações estrangeiras de propriedade privada, achando-se aquelas em pouso no território nacional ou em vôo no espaço aéreo correspondente, e estas em porto ou mar territorial do Brasil.",
                "filhos": []
              }
            ]
          },
          {
            "tipo": "principio",
            "nome": "Lugar do crime",
            "filhos": [
              {
                "tipo": "artigo",
                "nome": "Art. 6º - Considera-se praticado o crime no lugar em que ocorreu a ação ou omissão, no todo ou em parte, bem como onde se produziu ou deveria produzir-se o resultado.",
                "filhos": []
              }
            ]
          },
          {
            "tipo": "principio",
            "nome": "Extraterritorialidade",
            "filhos": [
              {
                "tipo": "artigo",
                "nome": "Art. 7º - Ficam sujeitos à lei brasileira, embora cometidos no estrangeiro: \r\n\r\n        I - os crimes: \r\n\r\n        a) contra a vida ou a liberdade do Presidente da República; \r\n\r\n        b) contra o patrimônio ou a fé pública da União, do Distrito Federal, de Estado, de Território, de Município, de empresa pública, sociedade de economia mista, autarquia ou fundação instituída pelo Poder Público; \r\n\r\n        c) contra a administração pública, por quem está a seu serviço; \r\n\r\n        d) de genocídio, quando o agente for brasileiro ou domiciliado no Brasil; \r\n\r\n        II - os crimes:  \r\n\r\n        a) que, por tratado ou convenção, o Brasil se obrigou a reprimir; \r\n\r\n        b) praticados por brasileiro; \r\n\r\n        c) praticados em aeronaves ou embarcações brasileiras, mercantes ou de propriedade privada, quando em território estrangeiro e aí não sejam julgados. \r\n\r\n        § 1º - Nos casos do inciso I, o agente é punido segundo a lei brasileira, ainda que absolvido ou condenado no estrangeiro.\r\n\r\n        § 2º - Nos casos do inciso II, a aplicação da lei brasileira depende do concurso das seguintes condições: \r\n\r\n        a) entrar o agente no território nacional; \r\n\r\n        b) ser o fato punível também no país em que foi praticado; \r\n\r\n        c) estar o crime incluído entre aqueles pelos quais a lei brasileira autoriza a extradição; \r\n\r\n        d) não ter sido o agente absolvido no estrangeiro ou não ter aí cumprido a pena; \r\n\r\n        e) não ter sido o agente perdoado no estrangeiro ou, por outro motivo, não estar extinta a punibilidade, segundo a lei mais favorável. \r\n\r\n        § 3º - A lei brasileira aplica-se também ao crime cometido por estrangeiro contra brasileiro fora do Brasil, se, reunidas as condições previstas no parágrafo anterior: \r\n\r\n        a) não foi pedida ou foi negada a extradição; \r\n\r\n        b) houve requisição do Ministro da Justiça.",
                "filhos": []
              }
            ]
          },
          {
            "tipo": "principio",
            "nome": "Pena cumprida no estrangeiro",
            "filhos": [
              {
                "tipo": "artigo",
                "nome": "Art. 8º - A pena cumprida no estrangeiro atenua a pena imposta no Brasil pelo mesmo crime, quando diversas, ou nela é computada, quando idênticas.",
                "filhos": []
              }
            ]
          },
          {
            "tipo": "principio",
            "nome": "Eficácia de sentença estrangeira",
            "filhos": [
              {
                "tipo": "artigo",
                "nome": "Art. 9º - A sentença estrangeira, quando a aplicação da lei brasileira produz na espécie as mesmas conseqüências, pode ser homologada no Brasil para: \r\n\r\n        I - obrigar o condenado à reparação do dano, a restituições e a outros efeitos civis;   \r\n\r\n        II - sujeitá-lo a medida de segurança.",
                "filhos": []
              }
            ]
          },
          {
            "tipo": "principio",
            "nome": "Parágrafo único",
            "filhos": [
              {
                "tipo": "artigo",
                "nome": "A homologação depende: \r\n\r\n        a) para os efeitos previstos no inciso I, de pedido da parte interessada; \r\n\r\n        b) para os outros efeitos, da existência de tratado de extradição com o país de cuja autoridade judiciária emanou a sentença, ou, na falta de tratado, de requisição do Ministro da Justiça.",
                "filhos": []
              }
            ]
          },
          {
            "tipo": "principio",
            "nome": "Contagem de prazo",
            "filhos": [
              {
                "tipo": "artigo",
                "nome": "Art. 10 - O dia do começo inclui-se no cômputo do prazo. Contam-se os dias, os meses e os anos pelo calendário comum.",
                "filhos": []
              }
            ]
          },
          {
            "tipo": "principio",
            "nome": "Frações não computáveis da pena",
            "filhos": [
              {
                "tipo": "artigo",
                "nome": "Art. 11 - Desprezam-se, nas penas privativas de liberdade e nas restritivas de direitos, as frações de dia, e, na pena de multa, as frações de cruzeiro.",
                "filhos": []
              }
            ]
          },
          {
            "tipo": "principio",
            "nome": "Legislação especial",
            "filhos": [
              {
                "tipo": "artigo",
                "nome": "Art. 12 - As regras gerais deste Código aplicam-se aos fatos incriminados por lei especial, se esta não dispuser de modo diverso.",
                "filhos": []
              }
            ]
          }
        ]
      },
      {
        "tipo": "titulo",
        "nome": "DO CRIME",
        "filhos": [
          {
            "tipo": "principio",
            "nome": "Relação de causalidade",
            "filhos": [
              {
                "tipo": "artigo",
                "nome": "Art. 13 - O resultado, de que depende a existência do crime, somente é imputável a quem lhe deu causa. Considera-se causa a ação ou omissão sem a qual o resultado não teria ocorrido.",
                "filhos": []
              }
            ]
          },
          {
            "tipo": "principio",
            "nome": "Superveniência de causa independente",
            "filhos": [
              {
                "tipo": "artigo",
                "nome": "Art. 13,   § 1º - A superveniência de causa relativamente independente exclui a imputação quando, por si só, produziu o resultado; os fatos anteriores, entretanto, imputam-se a quem os praticou. ",
                "filhos": []
              }
            ]
          },
          {
            "tipo": "principio",
            "nome": "Relevância da omissão",
            "filhos": [
              {
                "tipo": "artigo",
                "nome": "Art. 13,  § 2º - A omissão é penalmente relevante quando o omitente devia e podia agir para evitar o resultado. O dever de agir incumbe a quem:\\n\\n\n\n        a) tenha por lei obrigação de cuidado, proteção ou vigilância; \\n\n\n        b) de outra forma, assumiu a responsabilidade de impedir o resultado;\\n\n\n        c) com seu comportamento anterior, criou o risco da ocorrência do resultado.",
                "filhos": []
              }
            ]
          },
          {
            "tipo": "principio",
            "nome": "Crime consumado",
            "filhos": [
              {
                "tipo": "artigo",
                "nome": "Art. 14 - Diz-se o crime:\r\n\r\n        I - consumado, quando nele se reúnem todos os elementos de sua definição legal; ",
                "filhos": []
              }
            ]
          },
          {
            "tipo": "principio",
            "nome": "Tentativa",
            "filhos": [
              {
                "tipo": "artigo",
                "nome": "Art. 14 - Diz-se o crime: \r\n\r\n II - tentado, quando, iniciada a execução, não se consuma por circunstâncias alheias à vontade do agente.",
                "filhos": []
              }
            ]
          },
          {
            "tipo": "principio",
            "nome": "Pena de tentativa",
            "filhos": [
              {
                "tipo": "artigo",
                "nome": "Art. 14, Parágrafo único - Salvo disposição em contrário, pune-se a tentativa com a pena correspondente ao crime consumado, diminuída de um a dois terços.",
                "filhos": []
              }
            ]
          },
          {
            "tipo": "principio",
            "nome": "Desistência voluntária e arrependimento eficaz",
            "filhos": [
              {
                "tipo": "artigo",
                "nome": "Art. 15 - O agente que, voluntariamente, desiste de prosseguir na execução ou impede que o resultado se produza, só responde pelos atos já praticados.",
                "filhos": []
              }
            ]
          },
          {
            "tipo": "principio",
            "nome": "Arrependimento posterior",
            "filhos": [
              {
                "tipo": "artigo",
                "nome": "Art. 16 - Nos crimes cometidos sem violência ou grave ameaça à pessoa, reparado o dano ou restituída a coisa, até o recebimento da denúncia ou da queixa, por ato voluntário do agente, a pena será reduzida de um a dois terços.",
                "filhos": []
              }
            ]
          },
          {
            "tipo": "principio",
            "nome": "Crime impossível",
            "filhos": [
              {
                "tipo": "artigo",
                "nome": " Art. 17 - Não se pune a tentativa quando, por ineficácia absoluta do meio ou por absoluta impropriedade do objeto, é impossível consumar-se o crime.",
                "filhos": []
              }
            ]
          },
          {
            "tipo": "principio",
            "nome": "Crime doloso",
            "filhos": [
              {
                "tipo": "artigo",
                "nome": "Art. 18 - Diz-se o crime:\n\n        I - doloso, quando o agente quis o resultado ou assumiu o risco de produzi-lo;",
                "filhos": []
              }
            ]
          },
          {
            "tipo": "principio",
            "nome": "Crime culposo",
            "filhos": [
              {
                "tipo": "artigo",
                "nome": "Art. 18 - Diz-se o crime: \n\n        II - culposo, quando o agente deu causa ao resultado por imprudência, negligência ou imperícia.\n\n        Parágrafo único - Salvo os casos expressos em lei, ninguém pode ser punido por fato previsto como crime, senão quando o pratica dolosamente.",
                "filhos": []
              }
            ]
          },
          {
            "tipo": "principio",
            "nome": "Agravação pelo resultado",
            "filhos": [
              {
                "tipo": "artigo",
                "nome": "Art. 19 - Pelo resultado que agrava especialmente a pena, só responde o agente que o houver causado ao menos culposamente.",
                "filhos": []
              }
            ]
          },
          {
            "tipo": "principio",
            "nome": "Erro sobre elementos do tipo",
            "filhos": [
              {
                "tipo": "artigo",
                "nome": "Art. 20 - O erro sobre elemento constitutivo do tipo legal de crime exclui o dolo, mas permite a punição por crime culposo, se previsto em lei.",
                "filhos": []
              }
            ]
          },
          {
            "tipo": "principio",
            "nome": "Descriminantes putativas",
            "filhos": [
              {
                "tipo": "artigo",
                "nome": "Art. 20,   § 1º - É isento de pena quem, por erro plenamente justificado pelas circunstâncias, supõe situação de fato que, se existisse, tornaria a ação legítima. Não há isenção de pena quando o erro deriva de culpa e o fato é punível como crime culposo.",
                "filhos": []
              }
            ]
          },
          {
            "tipo": "principio",
            "nome": "Erro determinado por terceiro",
            "filhos": [
              {
                "tipo": "artigo",
                "nome": "Art. 20,    § 2º - Responde pelo crime o terceiro que determina o erro.",
                "filhos": []
              }
            ]
          },
          {
            "tipo": "principio",
            "nome": "  Erro sobre a pessoa",
            "filhos": [
              {
                "tipo": "artigo",
                "nome": "Aet. 20,   § 3º - O erro quanto à pessoa contra a qual o crime é praticado não isenta de pena. Não se consideram, neste caso, as condições ou qualidades da vítima, senão as da pessoa contra quem o agente queria praticar o crime. ",
                "filhos": []
              }
            ]
          },
          {
            "tipo": "principio",
            "nome": "Erro sobre a ilicitude do fato",
            "filhos": [
              {
                "tipo": "artigo",
                "nome": "Art. 21 - O desconhecimento da lei é inescusável. O erro sobre a ilicitude do fato, se inevitável, isenta de pena; se evitável, poderá diminuí-la de um sexto a um terço. \n\n        Parágrafo único - Considera-se evitável o erro se o agente atua ou se omite sem a consciência da ilicitude do fato, quando lhe era possível, nas circunstâncias, ter ou atingir essa consciência. ",
                "filhos": []
              }
            ]
          },
          {
            "tipo": "principio",
            "nome": "Coação irresistível e obediência hierárquica",
            "filhos": [
              {
                "tipo": "artigo",
                "nome": "Art. 22 - Se o fato é cometido sob coação irresistível ou em estrita obediência a ordem, não manifestamente ilegal, de superior hierárquico, só é punível o autor da coação ou da ordem.  ",
                "filhos": []
              }
            ]
          },
          {
            "tipo": "principio",
            "nome": "Exclusão de ilicitude",
            "filhos": [
              {
                "tipo": "artigo",
                "nome": "Art. 23 - Não há crime quando o agente pratica o fato:\n\n        I - em estado de necessidade;\n\n        II - em legítima defesa;\n\n        III - em estrito cumprimento de dever legal ou no exercício regular de direito.   ",
                "filhos": []
              }
            ]
          },
          {
            "tipo": "principio",
            "nome": "Excesso punível",
            "filhos": [
              {
                "tipo": "artigo",
                "nome": "Parágrafo único - O agente, em qualquer das hipóteses deste artigo, responderá pelo excesso doloso ou culposo.  ",
                "filhos": []
              }
            ]
          },
          {
            "tipo": "principio",
            "nome": "Estado de necessidade",
            "filhos": [
              {
                "tipo": "artigo",
                "nome": "Art. 24 - Considera-se em estado de necessidade quem pratica o fato para salvar de perigo atual, que não provocou por sua vontade, nem podia de outro modo evitar, direito próprio ou alheio, cujo sacrifício, nas circunstâncias, não era razoável exigir-se.\n\n        § 1º - Não pode alegar estado de necessidade quem tinha o dever legal de enfrentar o perigo. \n\n        § 2º - Embora seja razoável exigir-se o sacrifício do direito ameaçado, a pena poderá ser reduzida de um a dois terços.",
                "filhos": []
              }
            ]
          },
          {
            "tipo": "principio",
            "nome": "Legítima defesa",
            "filhos": [
              {
                "tipo": "artigo",
                "nome": "Art. 25 - Entende-se em legítima defesa quem, usando moderadamente dos meios necessários, repele injusta agressão, atual ou iminente, a direito seu ou de outrem. \n\n        Parágrafo único. Observados os requisitos previstos no caput deste artigo, considera-se também em legítima defesa o agente de segurança pública que repele agressão ou risco de agressão a vítima mantida refém durante a prática de crimes.      ",
                "filhos": []
              }
            ]
          }
        ]
      },
      {
        "tipo": "titulo",
        "nome": "DA IMPUTABILIDADE PENAL",
        "filhos": [
          {
            "tipo": "principio",
            "nome": "Inimputáveis",
            "filhos": [
              {
                "tipo": "artigo",
                "nome": "Art. 26 - É isento de pena o agente que, por doença mental ou desenvolvimento mental incompleto ou retardado, era, ao tempo da ação ou da omissão, inteiramente incapaz de entender o caráter ilícito do fato ou de determinar-se de acordo com esse entendimento.",
                "filhos": []
              }
            ]
          },
          {
            "tipo": "principio",
            "nome": "Redução de pena",
            "filhos": [
              {
                "tipo": "artigo",
                "nome": "Parágrafo único - A pena pode ser reduzida de um a dois terços, se o agente, em virtude de perturbação de saúde mental ou por desenvolvimento mental incompleto ou retardado não era inteiramente capaz de entender o caráter ilícito do fato ou de determinar-se de acordo com esse entendimento.",
                "filhos": []
              }
            ]
          },
          {
            "tipo": "principio",
            "nome": "Menores de dezoito anos",
            "filhos": [
              {
                "tipo": "artigo",
                "nome": "Art. 27 - Os menores de 18 (dezoito) anos são penalmente inimputáveis, ficando sujeitos às normas estabelecidas na legislação especial.",
                "filhos": []
              }
            ]
          },
          {
            "tipo": "principio",
            "nome": "Emoção e paixão",
            "filhos": [
              {
                "tipo": "artigo",
                "nome": "Art. 28 - Não excluem a imputabilidade penal:     \r\n\r\n        I - a emoção ou a paixão;",
                "filhos": []
              }
            ]
          },
          {
            "tipo": "principio",
            "nome": "Embriaguez",
            "filhos": [
              {
                "tipo": "artigo",
                "nome": "Art. 28 - Não excluem a imputabilidade penal:\r\n\r\n\tII - a embriaguez, voluntária ou culposa, pelo álcool ou substância de efeitos análogos. \r\n\r\n        § 1º - É isento de pena o agente que, por embriaguez completa, proveniente de caso fortuito ou força maior, era, ao tempo da ação ou da omissão, inteiramente incapaz de entender o caráter ilícito do fato ou de determinar-se de acordo com esse entendimento. \r\n\r\n        § 2º - A pena pode ser reduzida de um a dois terços, se o agente, por embriaguez, proveniente de caso fortuito ou força maior, não possuía, ao tempo da ação ou da omissão, a plena capacidade de entender o caráter ilícito do fato ou de determinar-se de acordo com esse entendimento.",
                "filhos": []
              }
            ]
          }
        ]
      },
      {
        "tipo": "titulo",
        "nome": "DO CONCURSO DE PESSOAS",
        "filhos": [
          {
            "tipo": "principio",
            "nome": "Concurso de Pessoas Art. 29",
            "filhos": [
              {
                "tipo": "artigo",
                "nome": "Art. 29 - Quem, de qualquer modo, concorre para o crime incide nas penas a este cominadas, na medida de sua culpabilidade.\r\n\r\n        § 1º - Se a participação for de menor importância, a pena pode ser diminuída de um sexto a um terço. \r\n\r\n        § 2º - Se algum dos concorrentes quis participar de crime menos grave, ser-lhe-á aplicada a pena deste; essa pena será aumentada até metade, na hipótese de ter sido previsível o resultado mais grave.",
                "filhos": []
              }
            ]
          },
          {
            "tipo": "principio",
            "nome": "Circunstâncias incomunicáveis",
            "filhos": [
              {
                "tipo": "artigo",
                "nome": "Art. 30 - Não se comunicam as circunstâncias e as condições de caráter pessoal, salvo quando elementares do crime.",
                "filhos": []
              }
            ]
          },
          {
            "tipo": "principio",
            "nome": "Casos de impunibilidade",
            "filhos": [
              {
                "tipo": "artigo",
                "nome": "Art. 31 - O ajuste, a determinação ou instigação e o auxílio, salvo disposição expressa em contrário, não são puníveis, se o crime não chega, pelo menos, a ser tentado.",
                "filhos": []
              }
            ]
          }
        ]
      },
      {
        "tipo": "titulo",
        "nome": "DAS PENAS",
        "filhos": [
          {
            "tipo": "principio",
            "nome": "Das espécies de pena – Art. 32",
            "filhos": [
              {
                "tipo": "artigo",
                "nome": "Art. 32 - As penas são:\r\n\r\n        I - privativas de liberdade;\r\n\r\n        II - restritivas de direitos;\r\n\r\n        III - de multa",
                "filhos": []
              }
            ]
          },
          {
            "tipo": "principio",
            "nome": "Das penas privativas de liberdade: Reclusão e Detenção – Art. 33",
            "filhos": [
              {
                "tipo": "artigo",
                "nome": "Art. 33 - A pena de reclusão deve ser cumprida em regime fechado, semi-aberto ou aberto. A de detenção, em regime semi-aberto, ou aberto, salvo necessidade de transferência a regime fechado. \r\n\r\n        § 1º - Considera-se:\r\n\r\n        a) regime fechado a execução da pena em estabelecimento de segurança máxima ou média;\r\n\r\n        b) regime semi-aberto a execução da pena em colônia agrícola, industrial ou estabelecimento similar;\r\n\r\n        c) regime aberto a execução da pena em casa de albergado ou estabelecimento adequado.\r\n\r\n        § 2º - As penas privativas de liberdade deverão ser executadas em forma progressiva, segundo o mérito do condenado, observados os seguintes critérios e ressalvadas as hipóteses de transferência a regime mais rigoroso:\r\n\r\n        a) o condenado a pena superior a 8 (oito) anos deverá começar a cumpri-la em regime fechado;\r\n\r\n        b) o condenado não reincidente, cuja pena seja superior a 4 (quatro) anos e não exceda a 8 (oito), poderá, desde o princípio, cumpri-la em regime semi-aberto;\r\n\r\n        c) o condenado não reincidente, cuja pena seja igual ou inferior a 4 (quatro) anos, poderá, desde o início, cumpri-la em regime aberto.\r\n\r\n        § 3º - A determinação do regime inicial de cumprimento da pena far-se-á com observância dos critérios previstos no art. 59 deste Código.\r\n\r\n        § 4o O condenado por crime contra a administração pública terá a progressão de regime do cumprimento da pena condicionada à reparação do dano que causou, ou à devolução do produto do ilícito praticado, com os acréscimos legais.",
                "filhos": []
              }
            ]
          },
          {
            "tipo": "principio",
            "nome": "Das penas privativas de liberdade: Regras do regime fechado – Art. 34",
            "filhos": [
              {
                "tipo": "artigo",
                "nome": "Art. 34 - O condenado será submetido, no início do cumprimento da pena, a exame criminológico de classificação para individualização da execução. \r\n\r\n        § 1º - O condenado fica sujeito a trabalho no período diurno e a isolamento durante o repouso noturno. \r\n\r\n        § 2º - O trabalho será em comum dentro do estabelecimento, na conformidade das aptidões ou ocupações anteriores do condenado, desde que compatíveis com a execução da pena.\r\n\r\n        § 3º - O trabalho externo é admissível, no regime fechado, em serviços ou obras públicas.",
                "filhos": []
              }
            ]
          },
          {
            "tipo": "principio",
            "nome": "Das penas privativas de liberdade: Regras do regime semiaberto – Art. 35",
            "filhos": [
              {
                "tipo": "artigo",
                "nome": "Referência:\r\n\"O condenado será submetido, no início do cumprimento da pena, a exame criminológico de classificação para individualização da execução.\"\r\n\r\n\r\nArt. 35 - Aplica-se a norma do art. 34 deste Código, caput, ao condenado que inicie o cumprimento da pena em regime semi-aberto. \r\n\r\n        § 1º - O condenado fica sujeito a trabalho em comum durante o período diurno, em colônia agrícola, industrial ou estabelecimento similar. \r\n\r\n        § 2º - O trabalho externo é admissível, bem como a freqüência a cursos supletivos profissionalizantes, de instrução de segundo grau ou superior.",
                "filhos": []
              }
            ]
          },
          {
            "tipo": "principio",
            "nome": "Das penas privativas de liberdade: Regras do regime aberto – Art. 36",
            "filhos": [
              {
                "tipo": "artigo",
                "nome": "Art. 36 - O regime aberto baseia-se na autodisciplina e senso de responsabilidade do condenado. \r\n\r\n        § 1º - O condenado deverá, fora do estabelecimento e sem vigilância, trabalhar, freqüentar curso ou exercer outra atividade autorizada, permanecendo recolhido durante o período noturno e nos dias de folga. \r\n\r\n        § 2º - O condenado será transferido do regime aberto, se praticar fato definido como crime doloso, se frustrar os fins da execução ou se, podendo, não pagar a multa cumulativamente aplicada.",
                "filhos": []
              }
            ]
          },
          {
            "tipo": "principio",
            "nome": "Das penas privativas de liberdade: Regime especial – Art. 37",
            "filhos": [
              {
                "tipo": "artigo",
                "nome": "Art. 37 - As mulheres cumprem pena em estabelecimento próprio, observando-se os deveres e direitos inerentes à sua condição pessoal, bem como, no que couber, o disposto neste Capítulo.",
                "filhos": []
              }
            ]
          },
          {
            "tipo": "principio",
            "nome": "Das penas privativas de liberdade: Direitos do preso – Art. 38",
            "filhos": [
              {
                "tipo": "artigo",
                "nome": "Art. 38 - O preso conserva todos os direitos não atingidos pela perda da liberdade, impondo-se a todas as autoridades o respeito à sua integridade física e moral.",
                "filhos": []
              }
            ]
          },
          {
            "tipo": "principio",
            "nome": "Das penas privativas de liberdade: Trabalho do preso – Art. 39",
            "filhos": [
              {
                "tipo": "artigo",
                "nome": "Art. 39 - O trabalho do preso será sempre remunerado, sendo-lhe garantidos os benefícios da Previdência Social.",
                "filhos": []
              }
            ]
          },
          {
            "tipo": "principio",
            "nome": "Das penas privativas de liberdade: Legislação especial – Art. 40",
            "filhos": [
              {
                "tipo": "artigo",
                "nome": "Art. 40 - A legislação especial regulará a matéria prevista nos arts. 38 e 39 deste Código, bem como especificará os deveres e direitos do preso, os critérios para revogação e transferência dos regimes e estabelecerá as infrações disciplinares e correspondentes sanções.",
                "filhos": []
              }
            ]
          },
          {
            "tipo": "principio",
            "nome": "Das penas privativas de liberdade: Superveniência de doença mental – Art. 41",
            "filhos": [
              {
                "tipo": "artigo",
                "nome": "Art. 41 - O condenado a quem sobrevém doença mental deve ser recolhido a hospital de custódia e tratamento psiquiátrico ou, à falta, a outro estabelecimento adequado.",
                "filhos": []
              }
            ]
          },
          {
            "tipo": "principio",
            "nome": "Das penas privativas de liberdade: Detração – Art. 42",
            "filhos": [
              {
                "tipo": "artigo",
                "nome": "Art. 42 - Computam-se, na pena privativa de liberdade e na medida de segurança, o tempo de prisão provisória, no Brasil ou no estrangeiro, o de prisão administrativa e o de internação em qualquer dos estabelecimentos referidos no artigo anterior.",
                "filhos": []
              }
            ]
          },
          {
            "tipo": "principio",
            "nome": "Das penas restritivas de direitos – Art. 43",
            "filhos": [
              {
                "tipo": "artigo",
                "nome": "Art. 43. As penas restritivas de direitos são: \r\n\r\n        I - prestação pecuniária; \r\n\r\n        II - perda de bens e valores; \r\n\r\n        III - limitação de fim de semana. \r\n\r\n        IV - prestação de serviço à comunidade ou a entidades públicas; \r\n\r\n        V - interdição temporária de direitos; \r\n\r\n        VI - limitação de fim de semana. \r\n\r\n        Art. 44. As penas restritivas de direitos são autônomas e substituem as privativas de liberdade, quando: \r\n\r\n        I – aplicada pena privativa de liberdade não superior a quatro anos e o crime não for cometido com violência ou grave ameaça à pessoa ou, qualquer que seja a pena aplicada, se o crime for culposo;\r\n\r\n        II – o réu não for reincidente em crime doloso; \r\n\r\n        III – a culpabilidade, os antecedentes, a conduta social e a personalidade do condenado, bem como os motivos e as circunstâncias indicarem que essa substituição seja suficiente. \r\n\r\n        § 2o Na condenação igual ou inferior a um ano, a substituição pode ser feita por multa ou por uma pena restritiva de direitos; se superior a um ano, a pena privativa de liberdade pode ser substituída por uma pena restritiva de direitos e multa ou por duas restritivas de direitos.  \r\n\r\n        § 3o Se o condenado for reincidente, o juiz poderá aplicar a substituição, desde que, em face de condenação anterior, a medida seja socialmente recomendável e a reincidência não se tenha operado em virtude da prática do mesmo crime. \r\n\r\n        § 4o A pena restritiva de direitos converte-se em privativa de liberdade quando ocorrer o descumprimento injustificado da restrição imposta. No cálculo da pena privativa de liberdade a executar será deduzido o tempo cumprido da pena restritiva de direitos, respeitado o saldo mínimo de trinta dias de detenção ou reclusão. \r\n\r\n        § 5o Sobrevindo condenação a pena privativa de liberdade, por outro crime, o juiz da execução penal decidirá sobre a conversão, podendo deixar de aplicá-la se for possível ao condenado cumprir a pena substitutiva anterior.",
                "filhos": []
              }
            ]
          },
          {
            "tipo": "principio",
            "nome": "Das penas restritivas de direitos: Conversão das penas restritivas de direitos – Art. 45",
            "filhos": [
              {
                "tipo": "artigo",
                "nome": "Art. 45. Na aplicação da substituição prevista no artigo anterior, proceder-se-á na forma deste e dos arts. 46, 47 e 48.\r\n\r\n        § 1o A prestação pecuniária consiste no pagamento em dinheiro à vítima, a seus dependentes ou a entidade pública ou privada com destinação social, de importância fixada pelo juiz, não inferior a 1 (um) salário mínimo nem superior a 360 (trezentos e sessenta) salários mínimos. O valor pago será deduzido do montante de eventual condenação em ação de reparação civil, se coincidentes os beneficiários. \r\n\r\n        § 2o No caso do parágrafo anterior, se houver aceitação do beneficiário, a prestação pecuniária pode consistir em prestação de outra natureza. \r\n\r\n        § 3o A perda de bens e valores pertencentes aos condenados dar-se-á, ressalvada a legislação especial, em favor do Fundo Penitenciário Nacional, e seu valor terá como teto – o que for maior – o montante do prejuízo causado ou do provento obtido pelo agente ou por terceiro, em conseqüência da prática do crime.",
                "filhos": []
              }
            ]
          },
          {
            "tipo": "principio",
            "nome": "Das penas restritivas de direitos: Prestação de serviços à comunidade ou a entidades públicas – Art. 46",
            "filhos": [
              {
                "tipo": "artigo",
                "nome": "Art. 46. A prestação de serviços à comunidade ou a entidades públicas é aplicável às condenações superiores a seis meses de privação da liberdade. \r\n\r\n        § 1o A prestação de serviços à comunidade ou a entidades públicas consiste na atribuição de tarefas gratuitas ao condenado.\r\n\r\n        § 2o A prestação de serviço à comunidade dar-se-á em entidades assistenciais, hospitais, escolas, orfanatos e outros estabelecimentos congêneres, em programas comunitários ou estatais.\r\n\r\n        § 3o As tarefas a que se refere o § 1o serão atribuídas conforme as aptidões do condenado, devendo ser cumpridas à razão de uma hora de tarefa por dia de condenação, fixadas de modo a não prejudicar a jornada normal de trabalho.\r\n\r\n        § 4o Se a pena substituída for superior a um ano, é facultado ao condenado cumprir a pena substitutiva em menor tempo (art. 55), nunca inferior à metade da pena privativa de liberdade fixada.",
                "filhos": []
              }
            ]
          },
          {
            "tipo": "principio",
            "nome": "Das penas restritivas de direitos: Interdição temporária de direitos – Art. 47",
            "filhos": [
              {
                "tipo": "artigo",
                "nome": "Art. 47 - As penas de interdição temporária de direitos são:\r\n\r\n        I - proibição do exercício de cargo, função ou atividade pública, bem como de mandato eletivo; \r\n\r\n        II - proibição do exercício de profissão, atividade ou ofício que dependam de habilitação especial, de licença ou autorização do poder público;\r\n\r\n        III - suspensão de autorização ou de habilitação para dirigir veículo.\r\n\r\n        IV – proibição de freqüentar determinados lugares. \r\n\r\n        V - proibição de inscrever-se em concurso, avaliação ou exame públicos.",
                "filhos": []
              }
            ]
          },
          {
            "tipo": "principio",
            "nome": "Das penas restritivas de direitos: Limitação de fim de semana – Art. 48",
            "filhos": [
              {
                "tipo": "artigo",
                "nome": "Art. 48 - A limitação de fim de semana consiste na obrigação de permanecer, aos sábados e domingos, por 5 (cinco) horas diárias, em casa de albergado ou outro estabelecimento adequado.  \r\n\r\n Parágrafo único - Durante a permanência poderão ser ministrados ao condenado cursos e palestras ou atribuídas atividades educativas.",
                "filhos": []
              }
            ]
          }
        ]
      },
      {
        "tipo": "titulo",
        "nome": "DAS MEDIDAS DE SEGURANÇA",
        "filhos": []
      },
      {
        "tipo": "titulo",
        "nome": "DA AÇÃO PENAL",
        "filhos": []
      },
      {
        "tipo": "titulo",
        "nome": "DA EXTINÇÃO DA PUNIBILIDADE",
        "filhos": []
      }
    ]
  },
  {
    "tipo": "titulo",
    "nome": "PARTE ESPECIAL",
    "filhos": []
  }
]